package JavaSommerSchuleStepik;

public class JavaSommerSchuleOutputInput3 {
    public static void main(String[] args) {
        for(int i = 1; i <=5; i++){
            System.out.print("Программировать - это легко! ");
        }
    }
}


/*
Выведите на экран фразу "Программировать - это легко! " 5 раз,  каждый раз через пробел.

Sample Input:

Sample Output:

Программировать - это легко! Программировать - это легко! Программировать - это легко! Программировать - это легко! Программировать - это легко!
*/

/*
Display the phrase “Programming is easy!” 5 times, each time separated by a space.

Sample Input:

Sample Output:

Programming is easy! Programming is easy! Programming is easy! Programming is easy! Programming is easy!
*/