package JavaSommerSchuleStepik;

public class JavaSommerSchuleOutputInput2 {
     public static void main(String[] args) {
        for(int i=1; i <= 3; i++){
        System.out.println("Программировать - это легко!");}
    }
}


/*
Выведите на экран фразу "Программировать - это легко! " 3 раза, каждый раз с новой строки.

Sample Input:

Sample Output:

Программировать - это легко!
Программировать - это легко!
Программировать - это легко!
*/

/*
Display the phrase “Programming is easy!” 3 times, each time on a new line.

Sample Input:

Sample Output:

Programming is easy!
Programming is easy!
Programming is easy!
*/